# x + y	Сложение
# a = 1 + 2
# print(a)


# x - y	Вычитание
# a = 1 - 2
# print(a)


# x * y	Умножение
# a = 1 * 2
# print(a)


# x / y	Деление
# a = 1 / 2
# print(a)


# x // y	Получение целой части от деления
# a = 1 // 2
# print(a)


# x % y	Остаток от деления
# a = 1 % 2
# print(a)

# -x	Смена знака числа
# a = [-1]
# a = [i*-1 for i in a]
# print(a) # [1]

# abs(x)	Модуль числа
# print(abs(-8)) # - 8

# divmod(x, y)	Пара (x // y, x % y)


# x ** y	Возведение в степень
# a = 4 ** 6
# print(a) # - 4096


# pow(x, y[, z])	xy по модулю (если модуль задан)


a = bool(0)
print(a)